<section class="container flex gap-6">
    <div class="flex flex-col w-1/2">
        <h2  x-data="revealOnScroll()" class="uppercase">Уважаемые коллеги!</h2>
        <p  x-data="revealOnScroll()" class="mb-6">Группа «Россети» завершила прошедший год с высокими результатами. Мы построили более 35 тыс. км
            линий
            электропередачи и ввели около 15 тыс. МВА трансформаторной мощности, присоединили к сети 340 тыс. новых
            потребителей. Инвестиции в модернизацию и развитие сетевой инфраструктуры увеличились до 725 млрд рублей.
            Выполненные проекты важны для всех 82 регионов, в которых работает Группа «Россети». Они создают новые
            возможности для роста экономики, реализации значимых социальных инициатив, укрепления энергической
            безопасности России.</p>
        <div  x-data="revealOnScroll()" class="rounded-2xl bg-blue-700 flex flex-col justify-between p-6 min-h-[250px] mb-2">
            <p class="mb-5 text-white">Инвестиции в модернизацию и развитие сетевой инфраструктуры увеличились до 725
                млрд рублей.
                Выполненные проекты важны для всех 82 регионов, в которых работает Группа «Россети». Они создают новые
                возможности для роста экономики, реализации значимых социальных инициатив, укрепления энергической
                безопасности России.</p>
            <p class="text-5xl text-white">725 млрд руб.</p>
            <p class="text-white">инвестиции в модернизацию и развитие сетевой инфраструктуры</p>
        </div>
        <div  x-data="revealOnScroll()" class="text-white rounded-2xl bg-blue-700 flex flex-col justify-between p-6 min-h-[250px] mb-6">
            <p class="mb-5 text-white">Группа «Россети» входит в число крупнейших налогоплательщиков страны. Высокие
                финансовые результаты, которые мы получили в 2025 году, позволили увеличить налоговые и социальные
                отчисления в бюджеты всех уровней до 270 млрд рублей.</p>
            <p class="text-5xl text-white">270 млрд руб.</p>
            <p class="text-white">сумма налоговых и социальных отчислений</p>
        </div>
        <p x-data="revealOnScroll()" >Мы продолжили последовательную работу по импортозамещению. Сегодня Группа «Россети» является одним из
            ключевых заказчиков высокотехнологичной продукции в России. Расширяя сотрудничество с ведущими российскими
            поставщиками оборудования и программных комплексов, мы поддерживаем развитие инновационных предприятий. Это
            необходимое условие для достижения технологического суверенитета.<br><br>

            Компания следует принципам ответственного ведения бизнеса. Продолжилась интеграция подходов ESG в систему
            стратегического планирования и корпоративного управления. В 2025 году Совет директоров Компании утвердил
            Политику в области прав человека — впервые в виде отдельного документа. Она закрепляет правила
            взаимодействия с сотрудниками, партнерами и обществом: запрет дискриминации, обеспечение безопасных условий
            труда и уважение культурных особенностей. Ранее эти положения учитывались в других базовых
            документах — Политике устойчивого развития и Кодексе корпоративной этики.</p>
    </div>

    <div class="flex flex-col w-1/2">
        <p x-data="revealOnScroll()"  class="mb-12"> Продолжилась системная работа, нацеленная на повышение экологической безопасности сетевого
            комплекса и
            бережное
            отношение к природным ресурсам. Особое внимание мы уделяем оснащению энергообъектов специальным
            оборудованием,
            которое предотвращает гибель птиц от ударов тока и снижает риски нештатных ситуаций, влияющих на надежность
            электроснабжения. В 2025 году было установлено более 153 тыс. таких устройств.
        </p>
        <div x-data="revealOnScroll()" class="flex flex-col items-center mb-12">
            <h3 class="text-blue-400 text-5xl">1,2 млрд руб.</h3>
            <p>расходы на охрану окружающей среды</p>
        </div>
        <p x-data="revealOnScroll()" class="mb-12">
            Ключевым фактором устойчивости остается человеческий капитал. За каждым результатом Компании стоят знания,
            опыт и ежедневный труд более чем 235 тыс. сотрудников. Группа «Россети» реализует комплексную кадровую
            политику, направленную на привлечение, развитие и удержание квалифицированных специалистов, а также на
            формирование условий для их безопасного труда и профессионального роста.
        </p>
        <div x-data="revealOnScroll()" class="flex flex-col items-center mb-12">
            <h3 class="text-blue-400 text-5xl">10,8 млрд руб.</h3>
            <p>расходы на мероприятия по охране труда</p>
        </div>
        <p x-data="revealOnScroll()">Также мы стремимся играть активную роль в жизни регионов присутствия, создаем специальные программы поддержки
            молодых семей и демографии, поддерживаем спортивные, образовательные и культурные инициативы.<br><br>
            В 2025 году мы реализовали масштабный проект, посвященный празднованию 80-летия Победы в Великой
            Отечественной войне. Его география охватила все регионы присутствия Группы «Россети» — от Калининграда
            до Хабаровска. В общей сложности мы провели более 100 мероприятий: организовали уличные фотовыставки, лекции
            и экскурсии, открыли интернет-портал, рассказывающий о подвиге фронтовиков-энергетиков и тружеников тыла,
            выпустили книгу «Свет Победы». Подводя итоги, хочу подчеркнуть, что для Группы «Россети» как крупнейшего
            электросетевого холдинга России, устойчивое развитие является не просто приоритетом, а неотъемлемой частью
            работы. Мы видим, что в последние годы нагрузка на энергосистему растет. Развитие технологий,
            распространение электромобилей, применение цифровых устройств, строительство мощных вычислительных центров
            только усиливают эту тенденцию. В таких условиях еще больше увеличивается значение сетевого комплекса как
            ключевой инфраструктуры, необходимой для реализации промышленных и социальных проектов, интеграции
            возобновляемых источников энергии, роста городских агломераций, а в конечном счете — для долгосрочного
            развития страны. И мы готовы решать поставленные задачи.
        </p>
    </div>
</section>
