<section x-data="revealOnScroll()" class="page-block page-block--current-topics container py-8 mb-20">
    <h2 x-data="revealOnScroll()" class="mb-4 text-[34px] leading-none uppercase  lg:text-[28px] md:text-[24px]">
        Существенные темы отчета
    </h2>

    <x-g-r-i gri="3-1, 3-2"/>

    <div x-data="revealOnScroll()" class="mb-6 grid grid-cols-2 gap-16 text-[18px] lg:grid-cols-1 lg:gap-4">
        <p>
            В 2025 году Компания сохранила ранее использованный подход к определению существенных тем
            с учетом требований и рекомендаций стандартов по нефинансовой отчетности GRI.
        </p>

        <p>
            Подход к анализу и определению существенности экологических, социальных показателей
            и показателей корпоративного управления включает:
        </p>
    </div>

    @php
        $items = [
            'Анализ текущих практик Компании с учетом национальных и международных стандартов',
            'Учет методологий присвоения ESG-рейтингов российских рейтинговых агентств',
            'Категоризация запросов заинтересованных сторон'
        ];
    @endphp
    <div x-data="revealOnScroll()" class="grid grid-cols-3 gap-1 lg:grid-cols-1 lg:gap-3">
        @foreach($items as $key => $item)
            <div class="relative rounded-[10px] bg-[#2497E8] px-5 py-7 text-[18px] leading-[1.25] text-white">
                <p class="text-white text-2xl">{{$item}}</p>

                @if($key !== 2)
                    <div
                        class="absolute right-[-11px] top-1/2 z-10 flex h-[22px] w-[22px] -translate-y-1/2 items-center justify-center rounded-full bg-white text-white lg:hidden">
                        <svg width="10" height="10" viewBox="0 0 10 10" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <g clip-path="url(#clip0_462_278)">
                                <path class="strike-blue-400"
                                      d="M0.909586 9.86271C0.821676 9.95062 0.702445 10 0.578124 10C0.453802 10 0.334573 9.95061 0.246666 9.8627C0.158758 9.77479 0.109374 9.65556 0.109375 9.53124C0.109377 9.40692 0.158766 9.28769 0.246675 9.19978L4.44646 4.99999L0.246675 0.800209C0.158765 0.712302 0.109377 0.593073 0.109375 0.468751C0.109373 0.344429 0.158758 0.225199 0.246665 0.137289C0.334573 0.0493798 0.453802 -8.16101e-06 0.578123 -1.00738e-05C0.702445 -1.19866e-05 0.821675 0.0493721 0.909585 0.137279L5.44083 4.66853C5.48436 4.71206 5.5189 4.76373 5.54245 4.82061C5.56601 4.87748 5.57814 4.93844 5.57814 4.99999C5.57814 5.06155 5.56601 5.12251 5.54245 5.17938C5.5189 5.23626 5.48436 5.28793 5.44083 5.33146L0.909586 9.86271ZM4.56033 0.800209L8.76011 4.99999L4.56033 9.19978C4.47242 9.28769 4.42303 9.40692 4.42303 9.53124C4.42303 9.65556 4.47241 9.77479 4.56032 9.8627C4.64822 9.95061 4.76745 10 4.89178 10C5.0161 10 5.13533 9.95062 5.22324 9.86271L9.75449 5.33146C9.79802 5.28793 9.83255 5.23626 9.85611 5.17938C9.87966 5.12251 9.89179 5.06155 9.89179 4.99999C9.89179 4.93844 9.87966 4.87748 9.85611 4.82061C9.83255 4.76373 9.79802 4.71206 9.75449 4.66853L5.22324 0.137279C5.13533 0.0493719 5.0161 -1.21751e-05 4.89178 -1.02624e-05C4.76745 -8.34957e-06 4.64822 0.0493796 4.56032 0.137289C4.47241 0.225199 4.42303 0.344429 4.42303 0.468751C4.42303 0.593073 4.47242 0.712302 4.56033 0.800209Z"
                                      fill="#2196F3"/>
                            </g>
                            <defs>
                                <clipPath id="clip0_462_278">
                                    <rect width="10" height="10" fill="white"
                                          transform="translate(4.37114e-07 10) rotate(-90)"/>
                                </clipPath>
                            </defs>
                        </svg>
                    </div>
                @endif
            </div>
        @endforeach
    </div>
</section>
