<section class="flex flex-col gap-4 p-8 bg-blue-400 container rounded-[10px] mb-24">
    <p x-data="revealOnScroll()" class="text-white text-2xl">Новое в Отчете</p>
    <div x-data="revealOnScroll()" class="flex gap-4 lg:flex-col">
        <p class="text-white">В этом году наш Отчет получил более выраженную стратегическую направленность за счет углубленного
            раскрытия вклада Компании в достижение национальных целей развития и реализацию приоритетных
            национальных проектов Российской Федерации. Деятельность Группы представлена в тесной увязке
            с государственной повесткой: показано, каким образом развитие электросетевой инфраструктуры,
            технологическое присоединение и инвестиционные проекты способствуют социально-экономическому развитию
            регионов, повышению доступности электроэнергии и формированию устойчивой энергетической системы
            страны.</p>
        <p class="text-white">Отдельный фокус сделан на аспектах, связанных с информационными технологиями, которые рассматриваются как
            ключевой фактор повышения эффективности и надежности электросетевого комплекса. В отчете отражена роль
            цифровых решений в управлении инфраструктурой, развитии клиентских сервисов и обеспечении
            технологического суверенитета. Акцент на ИТ демонстрирует переход к технологически более насыщенной
            модели развития, в которой цифровые инструменты становятся неотъемлемой частью устойчивого развития
            Компании.</p>
    </div>
</section>
