<section x-data="revealOnScroll()" class="page-block page-block--report-approval container grid grid-cols-2 lg:grid-cols-1 auto-rows-min gap-8">

    <div x-data="revealOnScroll()" class="flex flex-col">
        <h3 class="text-2xl mb-2 text-blue-500">Информация об утверждении и заверении Отчета</h3>

            <x-g-r-i gri="2-5, 2-14"/>

        <p class="text-ingerit">Отчет о социальной ответственности и корпоративном устойчивом развитии ПАО «Россети» (далее —Отчет) — 16-й публичный нефинансовый отчет, подготовленный ПАО «Россети» и адресованный широкому кругу заинтересованных сторон.
            Целью настоящего Отчета является формирование у заинтересованных сторон наиболее полного понимания деятельности Компании в области устойчивого развития, стратегических планов, потенциала их реализации и достигнутых результатов.
            Отчет утвержден Советом директоров ПАО «Россети» <span class="has-tooltip" data-tooltip="Протокол об итогах проведения заочного голосования для принятия решений Советом директоров от 25.06.2026 №726." aria-label="Протокол об итогах проведения заочного голосования для принятия решений Советом директоров от 25.06.2026 №726." data-alpine-devtools-right-click="">25.06.2026</span>. Документ прошел независимую аудиторскую проверку на соответствие требованиям Стандартов GRI к варианту «с учетом Стандартов GRI», а также общественное заверение Советом по нефинансовой отчетности Российского союза промышленников и предпринимателей.</p>
    </div>

    <x-general-text-with-title gri="2-5, 2-14" title="Наименование Компании "
                               text="Под терминами «Компания», «Группа», «Группа компаний», Группа «Россети», «Россети», «мы» понимается Группа компаний «Россети». Под термином «Общество» понимается ПАО «Россети»."/>
    <x-general-text-with-title title="Принципы подготовки Отчета "
                               text="Построение прозрачной системы раскрытия нефинансовой информации является одним из инструментов повышения эффективности взаимодействия с заинтересованными сторонами. Группа «Россети» стояла у истоков формирования российской системы раскрытия нефинансовой отчетности и поддерживает непрерывное развитие в данном направлении. Результаты нашей работы высоко оцениваются экспертным сообществом."/>
</section>
