<section x-data="revealOnScroll()"
         class="page-block page-block--strategy container bg-gradient-to-br from-[#5CACF0]/[0.13] to-[#0E3A5C]/[0.13] rounded-[32px] flex lg:flex-col p-3 relative justify-between mb-14">
    <div class="flex flex-col p-[36px] lg:p-0 lg:mb-8">
        <h3 class="leading-[120%]">Каковы стратегические цели и практическая значимость подготовки <span class="text-nowrap text-blue-500">ПАО «Россети»</span> Отчета о социальной
            ответственности и корпоративном устойчивом развитии?</h3>
        <p>ПАО «Россети» более 15 лет раскрывает нефинансовую информацию в формате отдельного отчета, рассматривая его
            в качестве важного управленческого инструмента. Подготовка документа позволяет проводить самооценку,
            актуализировать приоритетные темы устойчивого развития и учитывать ожидания заинтересованных сторон.
            <br><br>Для
            Компании устойчивое развитие — не внешнее требование, а философия ответственного ведения бизнеса.
            За показателями стоят реальные результаты: надежное и доступное электроснабжение, повышение устойчивости
            энергосистемы, создание рабочих мест и вклад в развитие регионов и промышленности. Отчет отражает системную
            работу Группы «Россети» и ее долгосрочную ответственность перед обществом. Наша цель — развитие современной,
            технологичной и экологически ответственной инфраструктуры. Мы надеемся, что и Отчет за 2025 год станет
            не просто источником информации для заинтересованных сторон, а возможностью увидеть, как конкретные решения,
            люди и проекты складываются в единый процесс по развитию энергетики и будущего страны.</p>
    </div>

    <div class="bg-black-300 relative min-w-[460px] max-w-[460px] lg:min-w-0 rounded-[10px] lg:mx-auto flex">
        <img src="/fixed/zam-director.png" class="mt-auto max-w-[430px] max-h-[560px] lg:w-full object-cover mx-auto" alt="" data-no-lightbox>
        <span class="absolute bottom-6 lg:text-center  left-1/2 -translate-x-1/2 text-center flex text-white text-xl lg:text-lg  lg:p-2 text-nowrap lg:text-wrap">Врио Заместителя Генерального директора<br class="lg:hidden">  по стратегии, А. А. Полинов</span>
    </div>
</section>
