<section x-data="revealOnScroll()"
         class="container bg-gradient-to-br from-[#5CACF0]/[0.13] to-[#0E3A5C]/[0.13] rounded-[32px] flex p-3 relative justify-between mb-14">
    <div class="flex flex-col p-[36px]">
        <h3>Каковы стратегические цели и практическая значимость подготовки ПАО «Россети» Отчета о социальной
            ответственности и корпоративном устойчивом развитии?</h3>
        <p>ПАО «Россети» более 15 лет раскрывает нефинансовую информацию в формате отдельного отчета, рассматривая его
            в качестве важного управленческого инструмента. Подготовка документа позволяет проводить самооценку,
            актуализировать приоритетные темы устойчивого развития и учитывать ожидания заинтересованных сторон. Для
            Компании устойчивое развитие — не внешнее требование, а философия ответственного ведения бизнеса.
            За показателями стоят реальные результаты: надежное и доступное электроснабжение, повышение устойчивости
            энергосистемы, создание рабочих мест и вклад в развитие регионов и промышленности. Отчет отражает системную
            работу Группы «Россети» и ее долгосрочную ответственность перед обществом. Наша цель — развитие современной,
            технологичной и экологически ответственной инфраструктуры. Мы надеемся, что и Отчет за 2025 год станет
            не просто источником информации для заинтересованных сторон, а возможностью увидеть, как конкретные решения,
            люди и проекты складываются в единый процесс по развитию энергетики и будущего страны.</p>
    </div>

    <div class="bg-black-300 relative min-w-[460px] max-w-[460px] rounded-[10px]">
        <img src="/fixed/zam-director.png" class="max-w-[430px] max-h-[560px] object-cover mx-auto" alt="">
        <span class="absolute bottom-6 left-1/2 -translate-x-1/2 text-center text-white text-xl text-nowrap">Врио Заместителя Генерального директора<br>  по стратегии, А. А. Полинов</span>
    </div>
</section>
